Repository: devbyshima/starhash
Catalog: Packages/StarHashKit/Sources/StarHashKit/Resources/Localizable.xcstrings
Source language: en
Languages: rw

source: Balance %@.
rw: Amafaranga asigaye ni %@.

source: %@ and %@ %@.
rw: %@, kandi %@ %@.

source: %@ is still pending. Mark it as confirmed or failed.
rw: %@: biracyategerejwe. Hitamo niba byemejwe cyangwa byanze.

source: %@ message
rw: ubutumwa bwa %@

source: %@ sent you %@.
rw: %1$@ yakoherereje %2$@.

source: %@ sent you money.
rw: %@ yakoherereje amafaranga.

source: %@ to %@
rw: %@ kuri %@

source: %@ to %@ went through.
rw: Ubwishyu bwa %1$@ kuri %2$@ bwagenze neza.

source: %lld payments
rw: ubwishyu %lld

source: 1 payment
rw: ubwishyu 1

source: A message from %@ %@, but %@'s come from %@. Don't send any money back. Check your balance first.
rw: Ubutumwa buvuye kuri %@ %@, ariko ubwa %@ buva kuri %@. Ntugire amafaranga usubiza. Banza urebe amafaranga asigaye.

source: A message that %@ asks for money back. %@ never does. Check your balance before you send anything.
rw: Ubutumwa %1$@ burasaba ko usubiza amafaranga. %2$@ ntijya ibisaba. Banza urebe amafaranga asigaye mbere yo kohereza ikintu cyose.

source: All Time
rw: Igihe cyose

source: Did your payment go through?
rw: Ubwishyu bwawe bwagenze neza?

source: Money received
rw: Amafaranga yakiriwe

source: No %@ confirmed %@ within an hour, so StarHash marked it failed.
rw: Mu isaha imwe, %1$@ ntibwemeje %2$@, bityo StarHash ibyita ko byanze.

source: Nothing was paid or received this month.
rw: Nta mafaranga yishyuwe cyangwa yakiriwe uku kwezi.

source: Nothing was paid or received this week.
rw: Nta mafaranga yishyuwe cyangwa yakiriwe muri iki cyumweru.

source: Nothing was paid or received this year.
rw: Nta mafaranga yishyuwe cyangwa yakiriwe uyu mwaka.

source: Nothing was paid or received today.
rw: Nta mafaranga yishyuwe cyangwa yakiriwe uyu munsi.

source: Nothing was paid or received yet.
rw: Nta mafaranga arishyurwa cyangwa ngo yakirwe.

source: Payment confirmed
rw: Ubwishyu bwemejwe

source: Spent in total
rw: Byakoreshejwe byose hamwe

source: Spent this month
rw: Byakoreshejwe uku kwezi

source: Spent this week
rw: Byakoreshejwe iki cyumweru

source: Spent this year
rw: Byakoreshejwe uyu mwaka

source: Spent today
rw: Byakoreshejwe uyu munsi

source: This Month
rw: Uku kwezi

source: This Week
rw: Iki cyumweru

source: This Year
rw: Uyu mwaka

source: This may be a scam
rw: Ibi bishobora kuba ubutekamutwe

source: Today
rw: Uyu munsi

source: Yesterday
rw: Ejo hashize

source: You made %@ %@. Open StarHash to see where your money went.
rw: Wakoze %@ %@. Fungura StarHash urebe aho amafaranga yawe yagiye.

source: You received money %@. Open StarHash to see it.
rw: Wakiriye amafaranga %@. Fungura StarHash uyarebe.

source: You sent %@ in %@
rw: Wohereje %@ (%@)

source: Your %@
rw: Ukwezi kwawe kwa %@

source: Your payment didn't go through
rw: Ubwishyu bwawe ntibwakunze

source: Your payment to %@
rw: Ubwishyu bwawe kuri %@

source: Your payment to %@ went through.
rw: Ubwishyu bwawe kuri %@ bwagenze neza.

source: Your week
rw: Icyumweru cyawe

source: an unknown sender
rw: uwohereje utazwi

source: balance %@
rw: amafaranga asigaye %@

source: fee %@
rw: ikiguzi %@

source: in %@
rw: muri %@

source: looks like %@'s
rw: busa n'ubwa %@

source: message
rw: ubutumwa

source: received %@
rw: wakiriye %@

source: says you received %@
rw: buvuga ko wakiriye %@

source: this week
rw: iki cyumweru

source: your payment to %@
rw: ubwishyu bwawe kuri %@
